{
  "practices": [
    {
      "name": "デイリースクラム",
      "alias": "スタンドアップミーティング",
      "category": ["スクラム", "XP"],
      "description": "開発者が主体となって毎日15分で実施するスクラムイベント。スプリントゴール達成に向けた進捗の検査と計画の適応を行い、チームの集中と足並みをそろえる。",
      "reading": "かいはつしゃがしゅたいとなってまいにち15ふんでじっしするスクラムイベント。スプリントゴールたっせいにむけたしんちょくのけんさとけいかくのてきおうをおこない、チームのしゅうちゅうとあしなみをそろえる。"
    },
    {
      "name": "スプリント",
      "alias": "イテレーション",
      "category": ["スクラム", "XP"],
      "description": "1週間から4週間の固定された期間で、潜在的にリリース可能なプロダクトインクリメントを作成するタイムボックス。スクラムの心臓部となる反復単位。",
      "reading": "いっしゅうかんからよんしゅうかんのこていされたきかんで、せんざいてきにリリースかのうなプロダクトインクリメントをさくせいするタイムボックス。スクラムのしんぞうぶとなるはんぷくたんい。"
    },
    {
      "name": "スプリントレビュー",
      "category": ["スクラム"],
      "description": "スプリント終了時にスクラムチームとステークホルダーが集まり、スプリントで何が達成されたかをレビューする場。単なるデモではなく検査と適応のためのワークセッション。",
      "reading": "スプリントしゅうりょうじにスクラムチームとステークホルダーがあつまり、スプリントでなにがたっせいされたかをレビューするば。たんなるデモではなくけんさとてきおうのためのワークセッション。"
    },
    {
      "name": "スプリントレトロスペクティブ",
      "category": ["スクラム"],
      "description": "スプリントの最後に実施し、品質と効果を高める方法をチームで計画するスクラムイベント。KPTAフレームワークなどを用いてふりかえりを行う。",
      "reading": "スプリントのさいごにじっしし、ひんしつとこうかをたかめるほうほうをチームでけいかくするスクラムイベント。けぷたフレームワークなどをもちいてふりかえりをおこなう。"
    },
    {
      "name": "スプリントプランニング",
      "alias": "イテレーションプランニング",
      "category": ["スクラム", "XP"],
      "description": "スプリント開始時にスクラムチームが実施するイベント。スプリントゴールと必要な作業をスプリントバックログとして整理し、何をどのように実装するかを決める。",
      "reading": "スプリントかいしじにスクラムチームがじっしするイベント。スプリントゴールとひつようなさぎょうをスプリントバックログとしてせいりし、なにをどのようにじっそうするかをきめる。"
    },
    {
      "name": "プロダクトバックログ",
      "category": ["スクラム"],
      "description": "プロダクトを改善するためにチームが成すべき仕事のリスト。ビジネス価値の優先順位で並べられ、優先順位の高いアイテムほど詳細化されている。",
      "reading": "プロダクトをかいぜんするためにチームがなすべきしごとのリスト。ビジネスかちのゆうせんじゅんいでならべられ、ゆうせんじゅんいのたかいアイテムほどしょうさいかされている。"
    },
    {
      "name": "スプリントバックログ",
      "category": ["スクラム"],
      "description": "プロダクトバックログからスプリント用に選択したアイテムをタスクに分解したもの。開発者により優先順位付けされ、開発者が責任を持って管理する計画。",
      "reading": "プロダクトバックログからスプリントようにせんたくしたアイテムをタスクにぶんかいしたもの。かいはつしゃによりゆうせんじゅんいづけされ、かいはつしゃがせきにんをもってかんりするけいかく。"
    },
    {
      "name": "スクラムマスター",
      "category": ["スクラム"],
      "description": "スクラムチーム全体が自己管理し協働できるよう支援・奉仕するリーダー。指揮命令ではなく、チームが動きやすいよう障害を取り除く奉仕型リーダーシップが特徴。",
      "reading": "スクラムチームぜんたいがじこかんりしきょうどうできるようしえん・ほうしするリーダー。しきめいれいではなく、チームがうごきやすいようしょうがいをとりのぞくほうしがたリーダーシップがとくちょう。"
    },
    {
      "name": "プロダクトオーナー",
      "category": ["スクラム"],
      "description": "プロダクトの価値最大化に責任を持つ単一の個人。プロダクトゴールを策定・伝達し、プロダクトバックログアイテムを作成・優先順位付けする役割。",
      "reading": "プロダクトのかちさいだいかにせきにんをもつたんいつのこじん。プロダクトゴールをさくてい・でんたつし、プロダクトバックログアイテムをさくせい・ゆうせんじゅんいづけするやくわり。"
    },
    {
      "name": "完成の定義",
      "url": "https://www.agile-studio.jp/post/apm-definition-of-done",
      "category": ["スクラム(補完)"],
      "description": "インクリメントが完成と見なされるために満たすべき基準。チームが何ができたら終わりなのかを明確にし、品質基準を共通認識するための定義。",
      "reading": "インクリメントがかんせいとみなされるためにみたすべききじゅん。チームがなにができたらおわりなのかをめいかくにし、ひんしつきじゅんをきょうつうにんしきするためのていぎ。"
    },
    {
      "name": "インクリメント",
      "category": ["スクラム"],
      "description": "スプリント内で作成されるプロダクトの最新版であり、スプリント終了時にレビューされる検査可能な成果。動くソフトウェアとして提示される。",
      "reading": "スプリントないでさくせいされるプロダクトのさいしんばんであり、スプリントしゅうりょうじにレビューされるけんさかのうなせいか。うごくソフトウェアとしてていじされる。"
    },
    {
      "name": "スプリントゴール",
      "url": "https://www.agile-studio.jp/post/apm-sprint-goal",
      "category": ["スクラム(補完)"],
      "description": "スプリントの唯一の目的を表す短い文章。スプリントバックログのコミットメントとして、チームの結束と集中を維持する役割を果たす。",
      "reading": "スプリントのゆいいつのもくてきをあらわすみじかいぶんしょう。スプリントバックログのコミットメントとして、チームのけっそくとしゅうちゅうをいじするやくわりをはたす。"
    },
    {
      "name": "プロダクトゴール",
      "url": "https://www.agile-studio.jp/post/apm-product-goal",
      "category": ["スクラム(補完)"],
      "description": "スクラムチームの長期的な目標であり、プロダクトの目的を表すもの。チームが今、何に向かって存在しているのかを明確にする。",
      "reading": "スクラムチームのちょうきてきなもくひょうであり、プロダクトのもくてきをあらわすもの。チームがいま、なににむかってそんざいしているのかをめいかくにする。"
    },
    {
      "name": "バックログリファインメント",
      "category": ["スクラム"],
      "description": "プロダクトバックログアイテムを準備完了の状態にするため、チームが協力して詳細化、分割、見積り、優先順位変更などを行う活動。スプリント期間の10%まで使用。",
      "reading": "プロダクトバックログアイテムをじゅんびかんりょうのじょうたいにするため、チームがきょうりょくしてしょうさいか、ぶんかつ、みつもり、ゆうせんじゅんいへんこうなどをおこなうかつどう。スプリントきかんの10パーセントまでしよう。"
    },
    {
      "name": "ユーザーストーリー",
      "url": "https://www.agile-studio.jp/post/apm-user-story",
      "category": ["XP"],
      "description": "チームが作り出す成果を顧客目線で簡潔に説明したもの。実装の詳細でも完全な要求仕様でもなく、顧客と開発者の対話を通じて顧客価値を表現し、明確な完了基準を備えた形で生み出される。",
      "reading": "チームがつくりだすせいかをこきゃくめせんでかんけつにせつめいしたもの。じっそうのしょうさいでもかんぜんなようきゅうしようでもなく、こきゃくとかいはつしゃのたいわをつうじてこきゃくかちをひょうげんし、めいかくなかんりょうきじゅんをそなえたかたちでうみだされる。"
    },
    {
      "name": "ベロシティ",
      "url": "https://www.agile-studio.jp/post/apm-velocity",
      "category": ["スクラム(補完)"],
      "description": "チームが1つのスプリントで完了したプロダクトバックログアイテムのストーリーポイント合計。計画作成やチームの継続的改善の診断に活用される指標。",
      "reading": "チームがひとつのスプリントでかんりょうしたプロダクトバックログアイテムのストーリーポイントごうけい。けいかくさくせいやチームのけいぞくてきかいぜんのしんだんにかつようされるしひょう。"
    },
    {
      "name": "プランニングポーカー",
      "url": "https://www.agile-studio.jp/post/apm-planning-poker",
      "category": ["スクラム(補完)"],
      "description": "チームが協力して作業の規模を見積もるためのカードを使った手法。フィボナッチ数が記載されたカードを用い、アンカリングを防ぎながら見積もりを行う。",
      "reading": "チームがきょうりょくしてさぎょうのきぼをみつもるためのカードをつかったしゅほう。フィボナッチすうがきさいされたカードをもちい、アンカリングをふせぎながらみつもりをおこなう。"
    },
    {
      "name": "相対見積もり",
      "url": "https://www.agile-studio.jp/post/apm-relative-estimation",
      "category": ["スクラム(補完)"],
      "description": "作業の規模を絶対値ではなく他の作業との相対的な大きさで見積もる手法。ストーリーポイントなどを用いて複雑さや労力を表現する。",
      "reading": "さぎょうのきぼをぜったいちではなくほかのさぎょうとのそうたいてきなおおきさでみつもるしゅほう。ストーリーポイントなどをもちいてふくざつさやろうりょくをひょうげんする。"
    },
    {
      "name": "リリースプランニング",
      "url": "https://www.agile-studio.jp/post/apm-release-planning",
      "category": ["XP"],
      "description": "スプリントよりも長い期間（通常3〜6ヶ月）にわたる抽象度の高いリリース計画を立てるプラクティス。計画期間の最後に1度だけリリースするのではなく、その中に複数回のリリースが含まれるのが普通である。",
      "reading": "スプリントよりもながいきかん、つうじょう3からろっかげつにわたるちゅうしょうどのたかいリリースけいかくをたてるプラクティス。けいかくきかんのさいごにいちどだけリリースするのではなく、そのなかにふくすうかいのリリースがふくまれるのがふつうである。"
    },
    {
      "name": "ペアリング",
      "url": "https://www.agile-studio.jp/post/apm-pairing",
      "category": ["XP"],
      "description": "2人が1つのコンピュータに集まってプログラミングする活動。欠陥混入の防止やメンテナンス可能なコード作成、チームメンバー間の学習と信頼関係構築を目的として実践される。",
      "reading": "ふたりがひとつのコンピューターにあつまってプログラミングするかつどう。けっかんこんにゅうのぼうしやメンテナンスかのうなコードさくせい、チームメンバーかんのがくしゅうとしんらいかんけいこうちくをもくてきとしてじっせんされる。"
    },
    {
      "name": "モブプログラミング",
      "url": "https://www.agile-studio.jp/post/apm-mob-programming",
      "category": ["XP"],
      "description": "3人以上の開発者が1つのコンピュータに集まってプログラミングする活動。タイピストとナビゲーターの役割に分かれ、小さなタスク単位で頻繁に役割を交代しながら進める。",
      "reading": "3にんいじょうのかいはつしゃがひとつのコンピューターにあつまってプログラミングするかつどう。タイピストとナビゲーターのやくわりにわかれ、ちいさなタスクたんいでひんぱんにやくわりをこうたいしながらすすめる。"
    },
    {
      "name": "テスト駆動開発",
      "url": "https://www.agile-studio.jp/post/apm-test-driven-development",
      "category": ["XP"],
      "description": "まずテストを書き、それをパスする最小限の実装をし、リファクタリングするRed/Green/Refactorサイクルで開発を進める技法。",
      "reading": "まずテストをかき、それをパスするさいしょうげんのじっそうをし、リファクタリングするレッド・グリーン・リファクターサイクルでかいはつをすすめるぎほう。"
    },
    {
      "name": "継続的インテグレーション",
      "url": "https://www.agile-studio.jp/post/apm-continuous-integration",
      "category": ["XP"],
      "description": "1日に複数回変更内容を統合しテストし、意図せずビルドに失敗すれば即対応することで全体のコードが安定している状態を維持するプラクティス。問題箇所の特定と修復を早期に行い、開発速度の向上と品質維持を実現する。",
      "reading": "いちにちにふくすうかいへんこうないようをとうごうしテストし、いとせずビルドにしっぱいすればそくたいおうすることでぜんたいのコードがあんていしているじょうたいをいじするプラクティス。もんだいかしょのとくていとしゅうふくをそうきにおこない、かいはつそくどのこうじょうとひんしついじをじつげんする。"
    },
    {
      "name": "受け入れテスト",
      "url": "https://www.agile-studio.jp/post/apm-acceptance-tests",
      "category": ["XP"],
      "description": "顧客やビジネス関係者が定義した受け入れ条件を満たすかどうかを検証するテスト。開発チームが顧客のニーズを正確に理解し期待通りの機能を提供していることを確認する。",
      "reading": "こきゃくやビジネスかんけいしゃがていぎしたうけいれじょうけんをみたすかどうかをけんしょうするテスト。かいはつチームがこきゃくのニーズをせいかくにりかいしきたいどおりのきのうをていきょうしていることをかくにんする。"
    },
    {
      "name": "ユーザーストーリーマッピング",
      "url": "https://www.agile-studio.jp/post/apm-user-story-mapping",
      "category": ["価値探索"],
      "description": "プロダクトの全体像を顧客の行動軸と優先順位軸の2軸で整理し、チーム全体で何を優先的に提供すれば良いのかの理解を共有するための手法。小さくスライスされたユーザーストーリーだけではプロダクトの全体像を見失いがちだが、この手法で対話を続ければ見失うことがない。",
      "reading": "プロダクトのぜんたいぞうをこきゃくのこうどうじくとゆうせんじゅんいじくの2じくでせいりし、チームぜんたいでなにをゆうせんてきにていきょうすればよいのかのりかいをきょうゆうするためのしゅほう。ちいさくスライスされたユーザーストーリーだけではプロダクトのぜんたいぞうをみうしないがちだが、このしゅほうでたいわをつづければみうしなうことがない。"
    },
    {
      "name": "リーンキャンバス",
      "url": "https://www.agile-studio.jp/post/apm-lean-canvas",
      "category": ["価値探索"],
      "description": "ビジネスモデルの仮説のプランを1枚のキャンバスにまとめたもの。高速に作成・更新でき、簡潔にまとまり、携帯できるという特徴がある。顧客との対話を通じて学んだことをプランの再整理に活用する。",
      "reading": "ビジネスモデルのかせつのプランをいちまいのキャンバスにまとめたもの。こうそくにさくせい・こうしんでき、かんけつにまとまり、けいたいできるというとくちょうがある。こきゃくとのたいわをつうじてまなんだことをプランのさいせいりにかつようする。"
    },
    {
      "name": "インセプションデッキ",
      "url": "https://www.agile-studio.jp/post/apm-inception-deck",
      "category": ["価値探索", "チームビルディング"],
      "description": "プロダクトづくりに関わるメンバーが各々の意見を持ち寄って共通認識をつくり出すための10個の手ごわい質問で構成される対話の場。チーム立ち上げ時期やプロダクトの方向性を見直すタイミングでメンバーと対話しながらデッキを作成・更新する。",
      "reading": "プロダクトづくりにかかわるメンバーがおのおののいけんをもちよってきょうつうにんしきをつくりだすための10このてごわいしつもんでこうせいされるたいわのば。チームたちあげじきやプロダクトのほうこうせいをみなおすタイミングでメンバーとたいわしながらデッキをさくせい・こうしんする。"
    },
    {
      "name": "ワーキングアグリーメント",
      "url": "https://www.agile-studio.jp/post/apm-working-agreement",
      "category": ["スクラム(補完)"],
      "description": "チームが気持ちよく安心して力を発揮するために全員が合意した働き方の約束。暗黙の期待によるすれ違いを避け、チームメンバー間の共通認識を明確にする。",
      "reading": "チームがきもちよくあんしんしてちからをはっきするためにぜんいんがごういしたはたらきかたのやくそく。あんもくのきたいによるすれちがいをさけ、チームメンバーかんのきょうつうにんしきをめいかくにする。"
    },
    {
      "name": "幸福指標",
      "url": "https://www.agile-studio.jp/post/apm-happiness-metric",
      "category": ["スクラム(補完)"],
      "description": "チームメンバーの満足度やチーム状況を定量化し評価するための指標。チームが最適な状態にあるときメンバーは幸福感を感じモチベーションとパフォーマンスが向上する。",
      "reading": "チームメンバーのまんぞくどやチームじょうきょうをていりょうかしひょうかするためのしひょう。チームがさいてきなじょうたいにあるときメンバーはこうふくかんをかんじモチベーションとパフォーマンスがこうじょうする。"
    },
    {
      "name": "準備完了の定義",
      "url": "https://www.agile-studio.jp/post/apm-definition-of-ready",
      "category": ["スクラム(補完)"],
      "description": "プロダクトバックログアイテムがスプリントで着手可能な状態かを判断する基準。スプリント内の不確実性や手戻りを減らすために用いる。",
      "reading": "プロダクトバックログアイテムがスプリントでちゃくしゅかのうなじょうたいかをはんだんするきじゅん。スプリントないのふかくじつせいやてもどりをへらすためにもちいる。"
    },
    {
      "name": "バーンダウンチャート",
      "url": "https://www.agile-studio.jp/post/apm-burndown-chart",
      "category": ["スクラム(補完)"],
      "description": "スプリント中の作業完了を追跡する視覚的ツール。残作業を縦軸、時間を横軸に表示し、チームの進捗を可視化する。",
      "reading": "スプリントちゅうのさぎょうかんりょうをついせきするしかくてきツール。ざんさぎょうをたてじく、じかんをよこじくにひょうじし、チームのしんちょくをかしかする。"
    },
    {
      "name": "持続可能なペース",
      "url": "https://www.agile-studio.jp/post/apm-sustainable-pace",
      "category": ["XP"],
      "description": "チームが長期的に高い生産性を維持できるよう、無理のない作業速度で継続的に働くプラクティス。過度な残業や疲弊を避け、フレッシュで集中した状態を保つ。",
      "reading": "チームがちょうきてきにたかいせいさんせいをいじできるよう、むりのないさぎょうそくどでけいぞくてきにはたらくプラクティス。かどなざんぎょうやひへいをさけ、フレッシュでしゅうちゅうしたじょうたいをたもつ。"
    },
    {
      "name": "チーム全体",
      "url": "https://www.agile-studio.jp/post/apm-whole-team",
      "category": ["XP"],
      "description": "プロジェクト成功に必要なスキルや視点を持つメンバーを集め、顧客を含めてクロスファンクショナルに協働するプラクティス。コミュニケーションを円滑にし開発スピードを向上させる。",
      "reading": "プロジェクトせいこうにひつようなスキルやしてんをもつメンバーをあつめ、こきゃくをふくめてクロスファンクショナルにきょうどうするプラクティス。コミュニケーションをえんかつにしかいはつスピードをこうじょうさせる。"
    },
    {
      "name": "シンプルな設計",
      "url": "https://www.agile-studio.jp/post/apm-simple-design",
      "category": ["XP"],
      "description": "現在の要求に対して最もシンプルな設計を選択し、不要な複雑さを排除するプラクティス。すべてのテストが通り、コードの意図が明確で、重複がなく、最小限の要素で構成することを目指す。",
      "reading": "げんざいのようきゅうにたいしてもっともシンプルなせっけいをせんたくし、ふようなふくざつさをはいじょするプラクティス。すべてのテストがとおり、コードのいとがめいかくで、じゅうふくがなく、さいしょうげんのようそでこうせいすることをめざす。"
    },
    {
      "name": "リファクタリング",
      "url": "https://www.agile-studio.jp/post/apm-refactoring",
      "category": ["XP"],
      "description": "外部から見た振る舞いを保ちつつ、ソフトウェアの内部構造を改善する活動。読みやすさや修正しやすさを高め、技術的負債を抑制し継続的な開発効率を保つ。",
      "reading": "がいぶからみたふるまいをたもちつつ、ソフトウェアのないぶこうぞうをかいぜんするかつどう。よみやすさやしゅうせいしやすさをたかめ、ぎじゅつてきふさいをよくせいしけいぞくてきなかいはつこうりつをたもつ。"
    },
    {
      "name": "共同所有",
      "url": "https://www.agile-studio.jp/post/apm-collective-ownership",
      "category": ["XP"],
      "description": "チームメンバーがシステムのあらゆるモジュールを誰でも変更できるようにするプラクティス。特定の人だけが修正するという制限を設けず、チーム全体で責任と知識を共有する。",
      "reading": "チームメンバーがシステムのあらゆるモジュールをだれでもへんこうできるようにするプラクティス。とくていのひとだけがしゅうせいするというせいげんをもうけず、チームぜんたいでせきにんとちしきをきょうゆうする。"
    },
    {
      "name": "メタファー",
      "url": "https://www.agile-studio.jp/post/apm-metaphor",
      "category": ["XP"],
      "description": "システム全体の共通理解を比喩を使って表現し、チーム全員が同じ世界観でコミュニケーションを取るプラクティス。技術的な概念を分かりやすく共有する。",
      "reading": "システムぜんたいのきょうつうりかいをひゆをつかってひょうげんし、チームぜんいんがおなじせかいかんでコミュニケーションをとるプラクティス。ぎじゅつてきながいねんをわかりやすくきょうゆうする。"
    },
    {
      "name": "開発者",
      "url": "https://www.agile-studio.jp/post/apm-developers",
      "category": ["XP"],
      "description": "ビジネスアナリスト、デザイナー、プログラマーなど多様な専門家で構成される機能横断的なチーム。価値あるインクリメントを作成し、ユーザーや顧客に価値を提供する役割。",
      "reading": "ビジネスアナリスト、デザイナー、プログラマーなどたようなせんもんかでこうせいされるきのうおうだんてきなチーム。かちあるインクリメントをさくせいし、ユーザーやこきゃくにかちをていきょうするやくわり。"
    },
    {
      "name": "MVP",
      "url": "https://www.agile-studio.jp/post/apm-mvp",
      "category": ["価値探索"],
      "description": "Minimum Viable Productの略で、新製品開発における仮説を検証可能な最小限の機能を備えた製品。リスクを最小限に抑えながら顧客のニーズに対応しフィードバックを収集するための戦略的アプローチであり、仮説の検証ができない製品や多機能な製品はMVPとは言えない。",
      "reading": "ミニマムバイアブルプロダクトのりゃくで、しんせいひんかいはつにおけるかせつをけんしょうかのうなさいしょうげんのきのうをそなえたせいひん。リスクをさいしょうげんにおさえながらこきゃくのニーズにたいおうしフィードバックをしゅうしゅうするためのせんりゃくてきアプローチであり、かせつのけんしょうができないせいひんやたきのうなせいひんはえむぶいぴーとはいえない。"
    },
    {
      "name": "狩野分析",
      "url": "https://www.agile-studio.jp/post/apm-kano-annalysis",
      "category": ["価値探索"],
      "description": "顧客の満足度と機能の充足度の関係を分析するフレームワーク。機能を当たり前品質、一元的品質、魅力的品質などに分類し、プロダクトの優先順位付けに活用する。",
      "reading": "こきゃくのまんぞくどときのうのじゅうそくどのかんけいをぶんせきするフレームワーク。きのうをあたりまえひんしつ、いちげんてきひんしつ、みりょくてきひんしつなどにぶんるいし、プロダクトのゆうせんじゅんいづけにかつようする。"
    },
    {
      "name": "ペルソナ",
      "url": "https://www.agile-studio.jp/post/apm-persona",
      "category": ["価値探索"],
      "description": "プロダクトの典型的なユーザー像を具体的な人物として描写したもの。名前、年齢、行動パターン、ニーズなどを設定し、チームがユーザー視点で意思決定するための共通認識を作る。",
      "reading": "プロダクトのてんけいてきなユーザーぞうをぐたいてきなじんぶつとしてびょうしゃしたもの。なまえ、ねんれい、こうどうパターン、ニーズなどをせっていし、チームがユーザーしてんでいしけっていするためのきょうつうにんしきをつくる。"
    }
  ]
}
